Revit.Filter.ParameterFilterElement
Parameter Filter Element

Revit.Filter.ParameterFilterElement.InternalRevitElement
Internal reference to the Revit Element

Revit.Filter.ParameterFilterElement.InternalElement
Reference to the Element

Revit.Filter.ParameterFilterElement.InternalSetElement(Autodesk.Revit.DB.ParameterFilterElement)
Set the internal Element, ElementId, and UniqueId
element:

Revit.Filter.ParameterFilterElement.#ctor(Autodesk.Revit.DB.ParameterFilterElement)
ParameterFilterElement from existing
elem:

Revit.Filter.ParameterFilterElement.#ctor(System.String,System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.ElementId},System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.FilterRule})
ParameterFilterElement by Rules
name:
ids:
rules:

Revit.Filter.ParameterFilterElement.InitElement(Autodesk.Revit.DB.ParameterFilterElement)
Init ParameterFilterElement from existing
element:

Revit.Filter.ParameterFilterElement.Init(System.String,System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.ElementId},System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.FilterRule})
Init ParameterFilterElement by rules
name:
ids:
rules:

Revit.Filter.ParameterFilterElement.ByRules(System.String,System.Collections.Generic.IEnumerable{Revit.Elements.Category},System.Collections.Generic.IEnumerable{Revit.Filter.FilterRule})
Create a Revit Parameter Filter Element
name: Name
categories: Categories the filter applies to
rules: Filter rules
Returns:

Revit.Filter.ParameterFilterElement.FromExisting(Autodesk.Revit.DB.ParameterFilterElement,System.Boolean)
From existing element
instance:
isRevitOwned:
Returns: